Use mermaid instead of ascii
